W7D1/99Cats/cats/app/controllers/cats_controller.rb

    def create
        @cat = Cat.new(cats_params)
        if @cat.save
---
INSERT INTO "cats" ("birth_date", "color", "name", "sex", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

    def update
        @cat = Cat.find_by(id: params[:id])
        @cat.update_attributes(cats_params)
---
SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "cats" SET "name" = $1, "color" = $2, "birth_date" = $3, "description" = $4, "updated_at" = $5 WHERE "cats"."id" = $6  [["name", "Mr.Peters"], ["color", "white"], ["birth_date", "2020-02-04"], ["description", "This is Mr.Peterson!"], ["updated_at", "2020-03-23 23:52:31.288857"], ["id", 2]]