W6D4/first_routes/app/controllers/artworks_controller.rb

    def index
        artworks = Artwork.where(artist_id: params[:user_id])

        shared_artworks = User.find_by(id: params[:user_id]).shared_artwork
---
SELECT "artworks".* FROM "artworks" WHERE "artworks"."artist_id" = $1  [["artist_id", 23]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 23], ["LIMIT", 1]]

    def destroy
        # note: we use find_by :id here because we used resources
        artwork = Artwork.find_by(id: params[:id])

        artwork.destroy
---
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
DELETE FROM "artworks" WHERE "artworks"."id" = $1  [["id", 5]]