W6D4/first_routes/app/controllers/artworkshares_controller.rb

    def index
        artworkshares = ArtworkShare.all
---
SELECT "artwork_shares".* FROM "artwork_shares"

    def create
        artworkshares = ArtworkShare.new(artworkshares_params)

        if artworkshares.save
---
INSERT INTO "artwork_shares" ("artwork_id", "viewer_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["artwork_id", 4], ["viewer_id", 5], ["created_at", "2020-03-20 21:48:54.086720"], ["updated_at", "2020-03-20 21:48:54.086720"]]