W6D4/first_routes/app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
UPDATE "users" SET "id" = $1 WHERE "users"."id" = $2  [["id", 1], ["id", 4]]
---
    def update
        user = User.find(params[:id])
        if user.update(user_params)

SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "1"], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 1]]
---
    def destroy
        # note: we use find_by :username because we defined a custom route
        # check routes.rb to see the difference between user and artwork
        user = User.find_by(username: params[:username])
        user.destroy