W6D4/first_routes/app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
---
    def destroy
        # note: we use find_by :username because we defined a custom route
        # check routes.rb to see the difference between user and artwork
        user = User.find(params[:id])