W6D3/first_routes/app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "email" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["email", "jd@gmail.com"], ["updated_at", "2020-03-19 23:19:01.394360"], ["id", 1]]
---
    def update
        # debugger
        user = User.find(params[:id])
        if user.update(user_params)