W8D1/RedditClone/app/models/user.rb

    def reset_session_token!
        self.session_token = SecureRandom.base64(64) #.urlsafe_base64
        self.save
---
INSERT INTO "users" ("username", "session_token", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "BGV1raWzipSbO0t1TyzjMSlf7FFhkWSWCV8M0yzaNqKPFQ9ZZ0auHB0ux3TbD7UZM55ZV7u967jjre1PgomNjw=="], ["updated_at", "2020-03-30 22:33:41.274570"], ["id", 5]]