W7D3/music_app/app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "email" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["email", "joe_deng@aa.io"], ["updated_at", "2020-03-26 05:26:06.536505"], ["id", 1]]
---
    def update
        @user = User.find_by(id: params[:id])
        if @user
            @user.update(user_params)